I'm using rbd storage for both `volumes.hdd` and `volumes.ssd`.

This is the template:
```
agent: 1
bios: ovmf
boot: order=scsi0;net0
cipassword: REDACTED
ciuser: ubuntu
cores: 1
cpu: x86-64-v3
efidisk0: volumes.hdd:base-269-disk-1,efitype=4m,pre-enrolled-keys=1,size=1M
ipconfig0: ip=dhcp
machine: pc-q35-9.0
memory: 1024
meta: creation-qemu=9.0.2,ctime=REDACTED
name: Template-Ubuntu24-v1.6
nameserver: REDACTED
net0: virtio=REDACTED,bridge=host0,firewall=1,tag=REDACTED
numa: 0
ostype: l26
scsi0: volumes.hdd:base-269-disk-0,cache=writeback,discard=on,iothread=1,size=15G
scsi1: volumes.hdd:vm-269-cloudinit,media=cdrom
scsihw: virtio-scsi-single
searchdomain: REDACTED
smbios1: uuid=REDACTED
sockets: 1
sshkeys: REDACTED
tags:  
template: 1
vmgenid: REDACTED
```

I do have the disk size defined as a variable `var.disk_size` which has a default value of `20` if someone doesn't define it when using the cloning module and `waf` vms do have it set explicitly anyway if you check again.

Also to be clear, the planning stage goes great, there are no discrepancies between the code and what's in the `tofu plan` log, it's when you actually `tofu apply` when trouble starts. And when you `tofu plan` again it detects discrepancies but is unable to resolve them with `tofu apply` and it goes round and round.

environments/experimental/main.tf
```
data "proxmox_virtual_environment_hagroups" "all" {}

data "proxmox_virtual_environment_hagroup" "group_details" {
  for_each = toset(data.proxmox_virtual_environment_hagroups.all.group_ids)
  group    = each.value
}

locals {
  node_group_map = merge([
    for group in data.proxmox_virtual_environment_hagroup.group_details : {
      for node in keys(group.nodes) : node => group.group
    }
  ]...)

  ubuntu_vms = {
    "zi-x-temp-1" = {
      ip_address    = "172.16.96.169/24"
      gateway       = "172.16.96.254"
      vlan_id       = 96
      description   = "REDACTED"
      tags          = ["zi", "experimental", "backup01-20"]
      node          = "n019"
      pool_id       = "backup-01-weekday-2000"
      cores         = 1
      memory        = 1024
      disk_size     = 25
      datastore_id  = "volumes.ssd"
    }
  }

resource "null_resource" "ha_group_dependency" {
  triggers = {
    ha_groups = join(",", data.proxmox_virtual_environment_hagroups.all.group_ids)
  }
}

module "ubuntu_vms" {
  source = "../../modules/ubuntu24_template_vm"
  for_each = local.ubuntu_vms
  name         = each.key
  description  = each.value.description
  tags         = each.value.tags
  node_name    = each.value.node
  cores        = each.value.cores
  memory       = each.value.memory
  disk_size    = each.value.disk_size
  ip_address   = each.value.ip_address
  gateway      = each.value.gateway
  vlan_id      = each.value.vlan_id
  datastore_id = each.value.datastore_id
  extra_nic    = lookup(each.value, "extra_nic", null)
  ha_group     = lookup(local.node_group_map, each.value.node, null)
  pool_id      = lookup(each.value, "pool_id", null)
}
```
planning
```
$ tofu plan -out=plan.tfplan
data.proxmox_virtual_environment_hagroups.all: Reading...
data.proxmox_virtual_environment_hagroups.all: Read complete after 0s [id=hagroups]
null_resource.ha_group_dependency: Refreshing state... [id=6798786016706828605]
data.proxmox_virtual_environment_hagroup.group_details["REDACTED"]: Reading...
data.proxmox_virtual_environment_hagroup.group_details["REDACTED"]: Reading...
data.proxmox_virtual_environment_hagroup.group_details["REDACTED"]: Read complete after 0s [id=REDACTED]
data.proxmox_virtual_environment_hagroup.group_details["REDACTED"]: Read complete after 0s [id=REDACTED]
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
OpenTofu will perform the following actions:
  # module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_haresource.vm_ha will be created
  + resource "proxmox_virtual_environment_haresource" "vm_ha" {
      + comment      = "Managed by Terraform"
      + group        = "REDACTED"
      + id           = (known after apply)
      + max_relocate = 1
      + max_restart  = 1
      + resource_id  = (known after apply)
      + state        = "started"
      + type         = (known after apply)
    }
  # module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu24_template_vm" {
      + acpi                    = true
      + bios                    = "ovmf"
      + boot_order              = [
          + "scsi0",
        ]
      + description             = "Eksperymentalna vmka do wygenerowania błędów w module proxmox"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "pc-q35-9.0"
      + migrate                 = true
      + name                    = "zi-x-temp-1"
      + network_interface_names = (known after apply)
      + node_name               = "n019"
      + on_boot                 = true
      + pool_id                 = "backup-01-weekday-2000"
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "zi",
          + "experimental",
          + "backup01-20",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)
      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = true
          + type    = "virtio"
        }
      + clone {
          + full      = true
          + node_name = "n022"
          + retries   = 1
          + vm_id     = 269
        }
      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 100
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "volumes.ssd"
          + discard           = "on"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 25
          + ssd               = false
        }
      + efi_disk {
          + datastore_id      = "volumes.ssd"
          + file_format       = "raw"
          + pre_enrolled_keys = true
          + type              = "4m"
        }
      + initialization {
          + datastore_id = "volumes.ssd"
          + interface    = "scsi1"
          + upgrade      = (known after apply)
          + dns {
              + domain  = "REDACTED"
              + servers = [
                  + "REDACTED",
                  + "REDACTED",
                ]
            }
          + ip_config {
              + ipv4 {
                  + address = "172.16.96.169/24"
                  + gateway = "172.16.96.254"
                }
            }
          + user_account {
              + keys     = [
                  + "REDACTED",
                ]
              + username = "ubuntu"
            }
        }
      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }
      + network_device {
          + bridge       = "host0"
          + disconnected = false
          + enabled      = true
          + firewall     = true
          + mac_address  = (known after apply)
          + model        = "virtio"
          + mtu          = 0
          + queues       = 0
          + rate_limit   = 0
          + vlan_id      = 96
        }
      + operating_system {
          + type = "l26"
        }
    }
Plan: 2 to add, 0 to change, 0 to destroy.
```
apply
```
$ tofu providers
Providers required by configuration:
.
├── provider[registry.opentofu.org/hashicorp/null]
├── provider[registry.opentofu.org/bpg/proxmox] 0.74.1
├── module.k8s_nodes
│   └── provider[registry.opentofu.org/bpg/proxmox] 0.74.1
└── module.ubuntu_vms
    └── provider[registry.opentofu.org/bpg/proxmox] 0.74.1
Providers required by state:
    provider[registry.opentofu.org/bpg/proxmox]
    provider[registry.opentofu.org/hashicorp/null]
$ tofu apply -parallelism=1 -lock=false -auto-approve plan.tfplan
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Creating...
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Still creating... [10s elapsed]
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Still creating... [20s elapsed]
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Still creating... [30s elapsed]
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Still creating... [40s elapsed]
module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm: Still creating... [50s elapsed]
╷
│ Error: disk update fails: error updating VM: received an HTTP 400 response - Reason: Parameter verification failed. (scsi0: invalid format - format error
│ scsi0.format: value 'hdd:vm-311-disk-1' does not have a value in the enumeration 'raw, cow, qcow, qed, qcow2, vmdk, cloop')
│ 
│   with module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm,
│   on ../../modules/ubuntu24_template_vm/main.tf line 11, in resource "proxmox_virtual_environment_vm" "ubuntu24_template_vm":
│   11: resource "proxmox_virtual_environment_vm" "ubuntu24_template_vm" {
│ 
╵
```
and the resulting vm looks like this, notice how efi and scsi0 are on hdd rather than ssd, disk is not resized either:

```
agent: enabled=1,fstrim_cloned_disks=1,type=virtio
balloon: 0
bios: ovmf
boot: order=scsi0;net0
cipassword: REDACTED
ciuser: ubuntu
cores: 1
cpu: cputype=x86-64-v3
cpuunits: 100
efidisk0: volumes.hdd:vm-311-disk-0,efitype=4m,pre-enrolled-keys=1,size=1M
ipconfig0: gw=172.16.96.254,ip=172.16.96.169/24
machine: pc-q35-9.0
memory: 1024
meta: creation-qemu=9.0.2,ctime=1740132715
name: zi-x-temp-1
nameserver: REDACTED
net0: virtio=REDACTED,bridge=host0,firewall=1,tag=96
numa: 0
onboot: 1
ostype: l26
scsi0: volumes.hdd:vm-311-disk-1,cache=writeback,discard=on,iothread=1,size=15G
scsi1: volumes.ssd:vm-311-cloudinit,media=cdrom
scsihw: virtio-scsi-single
searchdomain: REDACTED
smbios1: uuid=REDACTED
sockets: 1
sshkeys: REDACTED
tags: backup01-20;experimental;zi
vmgenid: REDACTED
```
when I attempt to plan again it detect that things are wrong, but it won't fix them when running apply:
```
Note: Objects have changed outside of OpenTofu
OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:
  # module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "ubuntu24_template_vm" {
        id                  = "311"
      + ipv4_addresses      = []
        name                = "zi-x-temp-1"
        tags                = [
            "zi",
            "experimental",
            "backup01-20",
        ]
        # (27 unchanged attributes hidden)
        # (9 unchanged blocks hidden)
    }
Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
─────────────────────────────────────────────────────────────────────────────
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
OpenTofu will perform the following actions:
  # module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_haresource.vm_ha will be created
  + resource "proxmox_virtual_environment_haresource" "vm_ha" {
      + comment      = "Managed by Terraform"
      + group        = "REDACTED"
      + id           = (known after apply)
      + max_relocate = 1
      + max_restart  = 1
      + resource_id  = (known after apply)
      + state        = "started"
      + type         = (known after apply)
    }
  # module.ubuntu_vms["zi-x-temp-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm is tainted, so it must be replaced
-/+ resource "proxmox_virtual_environment_vm" "ubuntu24_template_vm" {
      ~ id                      = "311" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:C9:83:63",
        ] -> (known after apply)
        name                    = "zi-x-temp-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "backup01-20",
          - "experimental",
            "zi",
          + "experimental",
          + "backup01-20",
        ]
      ~ vm_id                   = 311 -> (known after apply)
        # (25 unchanged attributes hidden)
      ~ cpu {
          - flags      = [] -> null
            # (7 unchanged attributes hidden)
        }
      ~ disk {
          ~ datastore_id      = "volumes.hdd" -> "volumes.ssd"
          ~ file_format       = "hdd:vm-311-disk-1" -> (known after apply)
          ~ path_in_datastore = "vm-311-disk-1" -> (known after apply)
          ~ size              = 15 -> 25
            # (8 unchanged attributes hidden)
        }
      ~ efi_disk {
          ~ datastore_id      = "volumes.hdd" -> "volumes.ssd"
            # (3 unchanged attributes hidden)
        }
      ~ initialization {
          ~ upgrade      = false -> (known after apply)
            # (2 unchanged attributes hidden)
          ~ user_account {
              - password = (sensitive value) -> null
                # (2 unchanged attributes hidden)
            }
            # (2 unchanged blocks hidden)
        }
      ~ network_device {
          ~ mac_address  = "REDACTED" -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (4 unchanged blocks hidden)
    }
Plan: 2 to add, 0 to change, 1 to destroy.
```
hope this helps to find the issue, sorry I had to redact many entities.